import 'package:flutter/material.dart';

class DicsScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Color(0xFFF4F5F5),
        body: Center(
            child: Container(
                margin: const EdgeInsets.fromLTRB(25.0, 25.0, 25.0, 25.0),
                child: Column(
                  children: <Widget>[
                    Text(
                        '[1] Настоящим даю согласие на обработку моих вышеуказанных персональных данных ООО \«ФОЛЬКСВАГЕН Груп Рус\» (248926, г. Калуга, ул. Автомобильная д. 1 / адрес Филиала в г. Москве (почтовый с целями: обработки моего запроса, направленного через сайт audi.ru, и коммуникации со мной в целях, связанных с обработкой и выполнением моего запроса с помощью различных средств связи, а именно посредством: интернет; сообщений на адрес электронной почты; коротких текстовых сообщений (SMS) и мультимедийных сообщений (MMS) на номер телефона; а также посредством использования информационно-коммуникационных сервисов, таких как Viber, WhatsApp и тому подобных; телефонных звонков. Я разрешаю совершать со своими персональными данными следующие действия: сбор, систематизацию, накопление, хранение (в электронном виде и на бумажном носителе), уточнение (обновление, изменение), использование, распространение (в том числе передачу) моих персональных данных третьим лицам, с которыми у Оператора имеются действующие договоры, в рамках которых Оператор поручает обработку персональных данных в вышеуказанных целях, включая трансграничную передачу персональных данных, обезличивание, блокирование, уничтожение, с использованием средств автоматизации и без использования таких средств. Я подтверждаю, что давая настоящее согласие на обработку моих вышеуказанных персональных данных, я нахожусь на территории Российской Федерации. Настоящее согласие на обработку моих персональных данных действует до момента выполнения моего запроса, направленного через сайт audi.ru и может быть отозвано мною ранее в соответствии со статьей 9 Федерального закона от 27.07.2006 года №152-ФЗ \«О персональных данных» посредством направления соответствующего письменного заявления по почтовому адресу Оператора, указанного в настоящем согласии, или в электронной форме посредством заполнения специальной формы \«Обратная связь\» на сайте www.audi.ru . ООО \«ФОЛЬКСВАГЕН Груп Рус\» ведет деятельность на территории Российской Федерации в соответствии с законодательством Российской Федерации. Предлагаемые Оператором, а также привлекаемыми им третьими лицами в заявленных в настоящем согласии целях товары/работы/услуги доступны к получению на территории Российской Федерации. Мониторинг потребительского поведения лиц, находящихся за пределами Российской Федерации, как Оператором, так и привлекаемыми им третьими лицами, не ведется.',
                        style: TextStyle(fontSize: 12.0)),
                    Text(
                        '[2] Настоящим даю согласие на обработку моих вышеуказанных персональных данных ООО \”ФОЛЬКСВАГЕН Груп Рус\” (248926, г. Калуга, ул. Автомобильная, д. 1 / (почтовый адрес) адрес Филиала в г. Москве) 117485, г. Москва, ул. Обручева, д. 30/1) (далее – Оператор)i с целями: учета предоставленной информации в базах данных; проведения статистических исследований, а также исследований, направленных на улучшение качества продукции и услуг; проведения маркетинговых программ, в том числе, для продвижения товаров, работ, услуг на рынке; информирования меня о новых товарах и услугах Оператора и партнеров Операторов (например, посредством отправки журналов, отправки приглашений на презентации продуктов, сообщений о технических нововведениях, предстоящих работах по сервисному обслуживанию, условиях покупки нового автомобиля и т.д.) с помощью различных средств связи, а именно посредством: интернет; сообщений на адрес электронной почты; коротких текстовых сообщений (SMS) и мультимедийных сообщений (MMS) на номер телефона; а также посредством использования информационно-коммуникационных сервисов, таких как Viber, WhatsApp и тому подобных; телефонных звонков. Я разрешаю совершать со своими персональными данными следующие действия: сбор, систематизацию, накопление, хранение (в электронном виде и на бумажном носителе), уточнение (обновление, изменение), использование, распространение (в том числе передачу) моих персональных данных третьим лицам, с которыми у Оператора имеются действующие договоры, в рамках которых Оператор поручает обработку персональных данных в вышеуказанных целях, включая трансграничную передачу персональных данных, обезличивание, блокирование, уничтожение, с использованием средств автоматизации и без использования таких средств. В целях проведения мркетинговых программ, в том числе для продвижения товаров, работ и услуг, ООО \«ФОЛЬКСВАГЕН Груп Рус\» может заключать соответствующие Договоры с третьими лицами относительно условий предоставления мне финансовых услуг. Настоящим я даю свое согласие на получение информации о предлагаемых такими третьими лицами финансовых услугах. Указанная информация может быть доведена до моего сведения как ООО \«ФОЛЬКСВАГЕН Груп Рус\», так и самими компаниями-партнерами ООО \«ФОЛЬКСВАГЕН Груп Рус\», предлагающими такие финансовые услуги, включая следующие: ООО \«Фольксваген Банк РУС\» (117485, г. Москва, ул. Обручева, д. 30/1, стр.1, ИНН: 7750005605, лицензия ЦБ РФ №3500), ООО \«ФВ Груп Финанц\» (Россия, 107045, г. Москва, ул. Трубная, 12, ИНН: 7702349370); ООО \«Фольксваген Финансовые Услуги РУС\» (Россия, 107045, г. Москва, ул. Трубная, 12, ИНН: 7702656396. Полный перечень компаний-партнеров ООО \«ФОЛЬКСВАГЕН Груп Рус\» в области предоставления финансовых услуг размещен на сайте www.audi.ru. Я подтверждаю, что давая настоящее согласие на обработку моих вышеуказанных персональных данных, я нахожусь на территории Российской Федерации. Настоящее согласие на обработку персональных данных действует до момента его отзыва в соответствии со статьей 9 Федерального закона от 27.07.2006 г. №152-ФЗ \«О персональных данных» посредством предоставления письменного заявления по почтовому адресу Оператора, указанному в настоящем согласии или в электронной форме посредством заполнения специальной формы \«Обратная связь\» на сайте www.audi.ru.',
                        style: TextStyle(fontSize: 12.0)),
                    ButtonTheme(
                        minWidth: 180.0,
                        height: 40.0,
                        child: RaisedButton(
                          child: Text('Назад'),
                          color: Color(0xFFFFFFFF),
                          textColor: Color(0xFF757575),
                          onPressed: () {
                            Navigator.pop(context);
                          },
                          shape: RoundedRectangleBorder(
                              borderRadius: new BorderRadius.circular(5.0)),
                        ))
                  ],
                ))));
  }
}
